/**
 * 高等数学
 */
export const advancedMathematicsSidebar = [
  {
    text: '知识点',
    prefix: '知识点',
    collapsible: true,
    children: [
      { text: '极限与连续', link: '极限与连续.md' },
      { text: '导数与微分', link: '导数与微分.md' },
      { text: '泰勒展开式与麦克劳林公式', link: '泰勒展开式与麦克劳林公式.md' },
      { text: '洛必达法则', link: '洛必达法则.md' },
      { text: '分段函数', link: '分段函数.md' },
    ],
  },
  {
    text: '微分方程',
    prefix: '微分方程',
    collapsible: true,
    children: [
      { text: '微分方程的基本概念', link: '1.微分方程的基本概念.md' },
      { text: '可分离变量的微分方程', link: '2.可分离变量的微分方程.md' },
      { text: '齐次方程', link: '3.齐次方程.md' },
      { text: '一阶线性微分方程', link: '4.一阶线性微分方程.md' },
      { text: '一些总结', link: '5.总结.md' },
    ],
  },
  {
    text: '数学二',
    prefix: '数学二',
    collapsible: true,
    children: [
      {
        text: '高数 上',
        prefix: '高数 上',
        collapsible: true,
        children: [
          {
            text: '第一章： 函数、极限、连续',
            prefix: '第一章： 函数、极限、连续',
            collapsible: true,
            children: [
              {
                text: '1.函数',
                prefix: '1.函数',
                collapsible: true,
                children: [
                  {
                    text: '1.函数的单调性、周期性、奇偶性',
                    link: '1.函数的单调性、周期性、奇偶性.md',
                  },
                  {
                    text: '2.复合函数',
                    link: '2.复合函数.md',
                  },
                ],
              },
              {
                text: '2.极限',
                prefix: '2.极限',
                collapsible: true,
                children: [
                  {
                    text: '1.求直接代入型的极限',
                    link: '1.求直接代入型的极限.md',
                  },
                  {
                    text: '2.求∞_∞型的极限',
                    link: '2.求∞_∞型的极限.md',
                  },
                  {
                    text: '3.用等价无穷小代换求0_0型的极限',
                    link: '3.用等价无穷小代换求0_0型的极限.md',
                  },
                  {
                    text: '4.用洛必达法则求0_0型或∞_∞型的极限',
                    link: '4.用洛必达法则求0_0型或∞_∞型的极限.md',
                  },
                  {
                    text: '5.求∞•0型的极限',
                    link: '5.求∞•0型的极限.md',
                  },
                  {
                    text: '6.求幂指函数的极限',
                    link: '6.求幂指函数的极限.md',
                  },
                  {
                    text: '7.函数的左右极限及需要求左右极限的情形',
                    link: '7.函数的左右极限及需要求左右极限的情形.md',
                  },
                  {
                    text: '8.极限的拆分',
                    link: '8.极限的拆分.md',
                  },
                  {
                    text: '9.无穷小的比较',
                    link: '9.无穷小的比较.md',
                  },
                  {
                    text: '10.无穷小与函数极限之间的关系',
                    link: '10.无穷小与函数极限之间的关系.md',
                  },
                  {
                    text: '11.利用极限的保号性判定极值点',
                    link: '11.利用极限的保号性判定极值点.md',
                  },
                  {
                    text: '12.求函数图像的渐近线',
                    link: '12.求函数图像的渐近线.md',
                  },
                  {
                    text: '13.利用夹逼定理求数列极限',
                    link: '13.利用夹逼定理求数列极限.md',
                  },
                  {
                    text: '14.1证明单调有界数列的极限存在（上）',
                    link: '14.1证明单调有界数列的极限存在（上）.md',
                  },
                  {
                    text: '14.2证明单调有界数列的极限存在（中）',
                    link: '14.2证明单调有界数列的极限存在（中）.md',
                  },
                  {
                    text: '14.3证明单调有界数列的极限存在（下）',
                    link: '14.3证明单调有界数列的极限存在（下）.md',
                  },
                ],
              },
              {
                text: '3.连续',
                prefix: '3.连续',
                collapsible: true,
                children: [
                  {
                    text: '1.证明连续、已知连续求未知参数',
                    link: '1.证明连续、已知连续求未知参数.md',
                  },
                  {
                    text: '2.零点定理',
                    link: '2.零点定理.md',
                  },
                  {
                    text: '3.介值定理推论',
                    link: '3.介值定理推论.md',
                  },
                  {
                    text: '4.间断点',
                    link: '4.间断点.md',
                  },
                ],
              },
            ],
          },
          {
            text: '第二章： 一元函数微分学',
            prefix: '第二章： 一元函数微分学',
            collapsible: true,
            children: [
              {
                text: '导数',
                prefix: '导数',
                collapsible: true,
                children: [
                  {
                    text: '1.判断函数在某点的可导性',
                    link: '1.判断函数在某点的可导性.md',
                  },
                  {
                    text: '2.一般函数求导',
                    link: '2.一般函数求导.md',
                  },
                  {
                    text: '3.隐函数求导',
                    link: '3.隐函数求导.md',
                  },
                  {
                    text: '4.求高阶导数',
                    link: '4.求高阶导数.md',
                  },
                  {
                    text: '5.利用导数定义求极限',
                    link: '5.利用导数定义求极限.md',
                  },
                  {
                    text: '6.参数方程求导（数三不用看）',
                    link: '6.参数方程求导（数三不用看）.md',
                  },
                  {
                    text: '7.反函数求导',
                    link: '7.反函数求导.md',
                  },
                  {
                    text: '8.求函数的极值',
                    link: '8.求函数的极值.md',
                  },
                  {
                    text: '9.求函数的最值',
                    link: '9.求函数的最值.md',
                  },
                  {
                    text: '10.求函数图像的凹凸区间、拐点',
                    link: '10.求函数图像的凹凸区间、拐点.md',
                  },
                  {
                    text: '11.求函数图像在某点处的切线方程、法线方程',
                    link: '11.求函数图像在某点处的切线方程、法线方程.md',
                  },
                  {
                    text: '12.单调区间、极值点、凹凸区间、拐点、切线斜率在函数图像上的反映',
                    link: '12.单调区间、极值点、凹凸区间、拐点、切线斜率在函数图像上的反映.md',
                  },
                  {
                    text: '13.根据已知的变化率求变化率',
                    link: '13.根据已知的变化率求变化率.md',
                  },
                  {
                    text: '14.利用单调性比较大小',
                    link: '14.利用单调性比较大小.md',
                  },
                  {
                    text: '15.证明不等式',
                    link: '15.证明不等式.md',
                  },
                  {
                    text: '16.利用拉格朗日中值定理证明函数不等式',
                    link: '16.利用拉格朗日中值定理证明函数不等式.md',
                  },
                  {
                    text: '17.利用函数图像的凹凸性证明函数不等式',
                    link: '17.利用函数图像的凹凸性证明函数不等式.md',
                  },
                  {
                    text: '20.利用单调性求根的个数',
                    link: '20.利用单调性求根的个数.md',
                  },
                  {
                    text: '21.利用罗尔定理推论求根的个数',
                    link: '21.利用罗尔定理推论求根的个数.md',
                  },
                  {
                    text: '22.微分中值定理（上）',
                    link: '22.微分中值定理（上）.md',
                  },
                  {
                    text: '23.微分中值定理（中）',
                    link: '23.微分中值定理（中）.md',
                  },
                  {
                    text: '24.微分中值定理（下）',
                    link: '24.微分中值定理（下）.md',
                  },
                  {
                    text: '25.泰勒公式',
                    link: '25.泰勒公式.md',
                  },
                  {
                    text: '26.利用泰勒公式证明不等式',
                    link: '26.利用泰勒公式证明不等式.md',
                  },
                ],
              },
            ],
          },
          {
            text: '第三章： 一元函数积分学',
            prefix: '第三章： 一元函数积分学',
            collapsible: true,
            children: [
              {
                text: '积分',
                prefix: '积分',
                collapsible: true,
                children: [
                  {
                    text: '1.求简单的不定积分',
                    link: '1.求简单的不定积分.md',
                  },
                  {
                    text: '2.用第一类换元法计算不定积分',
                    link: '2.用第一类换元法计算不定积分.md',
                  },
                  {
                    text: '3.用第二类换元法计算不定积分',
                    link: '3.用第二类换元法计算不定积分.md',
                  },
                  {
                    text: '4.用分部积分法计算不定积分',
                    link: '4.用分部积分法计算不定积分.md',
                  },
                  {
                    text: '5.计算定积分、广义积分（广义积分也叫反常积分）',
                    link: '5.计算定积分、广义积分（广义积分也叫反常积分）.md',
                  },
                  {
                    text: '6.判断广义积分的敛散性（广义积分也叫反常积分）',
                    link: '6.判断广义积分的敛散性（广义积分也叫反常积分）.md',
                  },
                  {
                    text: '7.积分中值定理',
                    link: '7.积分中值定理.md',
                  },
                  {
                    text: '8.利用拉格朗日中值定理证明积分不等式',
                    link: '8.利用拉格朗日中值定理证明积分不等式.md',
                  },
                  {
                    text: '9.利用柯西积分不等式证明积分不等式',
                    link: '9.利用柯西积分不等式证明积分不等式.md',
                  },
                  {
                    text: '10.变限积分函数的性质',
                    link: '10.变限积分函数的性质.md',
                  },
                  {
                    text: '11.变限积分函数求导',
                    link: '11.变限积分函数求导.md',
                  },
                  {
                    text: '12.利用变上限积分函数证明积分不等式',
                    link: '12.利用变上限积分函数证明积分不等式.md',
                  },
                  {
                    text: '13.利用定积分求数列极限',
                    link: '13.利用定积分求数列极限.md',
                  },
                  {
                    text: '14.利用定积分求平面面积',
                    link: '14.利用定积分求平面面积.md',
                  },
                  {
                    text: '15.利用定积分求旋转体侧面积（数三不用看）',
                    link: '15.利用定积分求旋转体侧面积（数三不用看）.md',
                  },
                  {
                    text: '16.利用定积分求旋转体体积',
                    link: '16.利用定积分求旋转体体积.md',
                  },
                ],
              },
            ],
          },
          {
            text: '第四章： 常微分方程',
            prefix: '第四章： 常微分方程',
            collapsible: true,
            children: [
              {
                text: '1.一阶微分方程（上）',
                link: '1.一阶微分方程（上）.md',
              },
              {
                text: '2.一阶微分方程（中）',
                link: '2.一阶微分方程（中）.md',
              },
              {
                text: '4.常系数齐次线性微分方程',
                link: '4.常系数齐次线性微分方程.md',
              },
              {
                text: '5.常系数非齐次线性微分方程',
                link: '5.常系数非齐次线性微分方程.md',
              },
              {
                text: '6.线性微分方程的解的结构',
                link: '6.线性微分方程的解的结构.md',
              },
              {
                text: '7.可降阶的高阶微分方程（数三不用看）',
                link: '7.可降阶的高阶微分方程（数三不用看）.md',
              },
            ],
          },
        ],
      },
      {
        text: '高数 下',
        prefix: '高数 下',
        collapsible: true,
        children: [
          {
            text: '第一章： 多元函数微分学',
            prefix: '第一章： 多元函数微分学',
            collapsible: true,
            children: [
              {
                text: '1.重极限',
                prefix: '1.重极限',
                collapsible: true,
                children: [
                  {
                    text: '1.计算重极限',
                    link: '1.计算重极限.md',
                  },
                  {
                    text: '2.证明重极限不存在',
                    link: '2.证明重极限不存在.md',
                  },
                ],
              },
              {
                text: '2.偏导',
                prefix: '2.偏导',
                collapsible: true,
                children: [
                  {
                    text: '1.求偏导（简单情况）',
                    link: '1.求偏导（简单情况）.md',
                  },
                  {
                    text: '2.求偏导（复杂情况）',
                    link: '2.求偏导（复杂情况）.md',
                  },
                  {
                    text: '3.用f′表示部分偏导',
                    link: '3.用f′表示部分偏导.md',
                  },
                  {
                    text: '4.用公式法求隐函数的偏导',
                    link: '4.用公式法求隐函数的偏导.md',
                  },
                  {
                    text: '5.用两边同求偏导法求隐函数的偏导',
                    link: '5.用两边同求偏导法求隐函数的偏导.md',
                  },
                  {
                    text: '6.求某点的偏导值',
                    link: '6.求某点的偏导值.md',
                  },
                  {
                    text: '7.已知偏导数，通过积分求表达式',
                    link: '7.已知偏导数，通过积分求表达式.md',
                  },
                  {
                    text: '8.变量代换下化简偏导数满足的关系式',
                    link: '8.变量代换下化简偏导数满足的关系式.md',
                  },
                ],
              },
              {
                text: '3.全微分',
                prefix: '3.全微分',
                collapsible: true,
                children: [
                  {
                    text: '1.求全微分',
                    link: '1.求全微分.md',
                  },
                  {
                    text: '2.已知全微分，求全微分里的未知数',
                    link: '2.已知全微分，求全微分里的未知数.md',
                  },
                ],
              },
              {
                text: '4.连续、可导、可微',
                prefix: '4.连续、可导、可微',
                collapsible: true,
                children: [
                  {
                    text: '1.判断函数在点(x0,y0)处是否可微',
                    link: '1.判断函数在点(x0,y0)处是否可微.md',
                  },
                  {
                    text: '2.判断函数在点(x0,y0)处是否连续',
                    link: '2.判断函数在点(x0,y0)处是否连续.md',
                  },
                  {
                    text: '3.连续、可导、可微的关系',
                    link: '3.连续、可导、可微的关系.md',
                  },
                ],
              },
              {
                text: '5.极值',
                prefix: '5.极值',
                collapsible: true,
                children: [
                  {
                    text: '1.一般函数求无条件极值',
                    link: '1.一般函数求无条件极值.md',
                  },
                  {
                    text: '2.利用定义判断极值点',
                    link: '2.利用定义判断极值点.md',
                  },
                  {
                    text: '3.在约束条件下找出可能的极值点',
                    link: '3.在约束条件下找出可能的极值点.md',
                  },
                ],
              },
              {
                text: '6.最值',
                prefix: '6.最值',
                collapsible: true,
                children: [
                  {
                    text: '1.在约束条件下求最值、最值点',
                    link: '1.在约束条件下求最值、最值点.md',
                  },
                  {
                    text: '2.在区域上求最值、最值点',
                    link: '2.在区域上求最值、最值点.md',
                  },
                ],
              },
            ],
          },
          {
            text: '第二章： 二重积分',
            prefix: '第二章： 二重积分',
            collapsible: true,
            children: [
              {
                text: '二重积分',
                prefix: '二重积分',
                collapsible: true,
                children: [
                  {
                    text: '1.计算二次积分',
                    link: '1.计算二次积分.md',
                  },
                  {
                    text: '2.求二重积分',
                    link: '2.求二重积分.md',
                  },
                  {
                    text: '3.交换二次积分的积分次序',
                    link: '3.交换二次积分的积分次序.md',
                  },
                  {
                    text: '4.通过交换二次积分的积分次序来计算积分',
                    link: '4.通过交换二次积分的积分次序来计算积分.md',
                  },
                  {
                    text: '5.通过极坐标变换来计算积分',
                    link: '5.通过极坐标变换来计算积分.md',
                  },
                  {
                    text: '6.通过直角坐标变换来计算积分',
                    link: '6.通过直角坐标变换来计算积分.md',
                  },
                  {
                    text: '7.通过对称性来计算积分',
                    link: '7.通过对称性来计算积分.md',
                  },
                  {
                    text: '8.通过轮换对称性来计算积分',
                    link: '8.通过轮换对称性来计算积分.md',
                  },
                  {
                    text: '9.通过积分区域的形心来计算积分',
                    link: '9.通过积分区域的形心来计算积分.md',
                  },
                  {
                    text: '10.比较二重积分的大小',
                    link: '10.比较二重积分的大小.md',
                  },
                  {
                    text: '11.二重积分中值定理',
                    link: '11.二重积分中值定理.md',
                  },
                  {
                    text: '12.函数表达式含二重积分',
                    link: '12.函数表达式含二重积分.md',
                  },
                ],
              },
            ],
          },
          {
            text: '第五章： 多元函数积分学',
            prefix: '第五章： 多元函数积分学',
            collapsible: true,
            children: [
              {
                text: '7.多元函数积分学',
                prefix: '7.多元函数积分学',
                collapsible: true,
                children: [
                  {
                    text: '1.计算长度、面积、体积、形心、质心(重心)、质量、转动惯量',
                    link: '1.计算长度、面积、体积、形心、质心(重心)、质量、转动惯量.md',
                  },
                  {
                    text: '2.计算变力做的功',
                    link: '2.计算变力做的功.md',
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
]
